{
    "upcomingEvents" : {
      "event1" : {
        "company" : "Founder/CTO Technology Strategies LLC, United States",
        "date" : "3rd April 2019 | 5:00 PM",
        "descr" : "After a brief overview and introducing the broad concepts to get every one on the same page, we will cover all the other topics in an interactive session. \nIntroduction to AI \nIntroduction to ML, \nIntroduction to DL, \nThe space of AI, Data Science, Big Data, Machine Learning, Deep Learning, Computer Vision, Neural Networks Technologies, \nApplied AI/ML - Applications in various industries",
        "location" : "NAVIS, CHENNAI 9TH FLOOR, ZENITH PHASE III, ASCENDAS IT PARK, TARAMANI, CSIR ROAD, CHENNAI",
        "name" : "A Gentle Introduction to AI and related technologies - Machine Learning, Deep Learning, Neural Networks.",
        "photo" : "https://i.pinimg.com/originals/8f/31/2b/8f312b3eff2287bf4ef5dac264a8e818.jpg",
        "profile_link" : "https://www.linkedin.com/in/doraithodla/",
        "speaker" : "Mr. Dorai Thodla"
      }
    },
    "pastEvents" : {
        "event1" : {
        "company" : "Director, Pramati Technologies India, Chennai",
        "date" : "6th March 2019 | 5:00 PM",
        "descr" : "The pervasive collection and availability of data has resulted in an increased interest in the field of machine learning to leverage it. While many good courses are available, ML's mathematical lineage continues to place it outside the range of many working programmers. In this talk, we'll see how the core ideas can be understood relative to what is common knowledge in the programming world, so that programmers not exposed to the field can identify opportunities for applying ML, understand how problems are formulated, ask critical questions and otherwise engage constructively with the field. We'll conclude with some notes on emerging ideas and the road ahead. <br /><i>Prerequisites</i>:  Some knowledge of functional programming would help, though not strictly necessary.",
        "location" : "NAVIS, CHENNAI 9TH FLOOR, ZENITH PHASE III, ASCENDAS IT PARK, TARAMANI, CSIR ROAD, CHENNAI",
        "name" : "Machine Learning as extreme TDD: An introduction for programmers.",
        "photo" : "https://i.pinimg.com/originals/8f/31/2b/8f312b3eff2287bf4ef5dac264a8e818.jpg",
        "profile_link" : "https://www.linkedin.com/in/srikumarks/",
        "speaker" : "Dr. Srikumar Subramanian"
      }
    }
  }
